src/CalculationRegisters/ДополнительныеНачисленияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ДополнительныеНачисленияРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Day</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисленияОрганизаций</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДнейЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкидкаПриНалогообложении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработкаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработкаОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Comment>Документ, который зарегистрировал сторнируемое начисление</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЕдиновременныхПособийЗаСчетФСС</v8:Type>
						<v8:Type>cfg:DocumentRef.НевыходыВОрганизациях</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияПростоевРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендовОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:DocumentRef.ПремииРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияРазовыхНачисленийРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РасчетПриУвольненииРаботникаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойРасчетСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CalculationRegisters/ДополнительныеНачисленияРаботниковОрганизаций/Ext/RecordSetModule.bsl
//толик
Процедура ПередЗаписью(Отказ, Замещение, ТолькоЗапись)
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		мРаботникиОрганизаций = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(?(ЗначениеЗаполнено(СтрокаНабора.ПериодДействияНачало),СтрокаНабора.ПериодДействияНачало,СтрокаНабора.БазовыйПериодНачало),//СтрокаНабора.ПериодДействияНачало,
			Новый Структура("Организация, Сотрудник", СтрокаНабора.Организация, СтрокаНабора.Сотрудник));
			
		мРаботникиОрганизацийОкончание = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(?(ЗначениеЗаполнено(СтрокаНабора.ПериодДействияКонец),СтрокаНабора.ПериодДействияКонец,СтрокаНабора.БазовыйПериодКонец),//СтрокаНабора.ПериодДействияКонец,
			Новый Структура("Организация, Сотрудник", СтрокаНабора.Организация, СтрокаНабора.Сотрудник)); //Аверсон 27.04.2022 КВВ СВФР-008970	
			
		//Аверсон ЕАЕ 07.12.2021 СВФР-008461
		//СтрокаНабора.Категория = мРаботникиОрганизаций.Категория;
		//Аверсон СВФР-008461
		
		СтрокаНабора.Должность = мРаботникиОрганизаций.Должность;
		
		//Аверсон 27.04.2022 КВВ СВФР-008970 (
		ПроверкаНаОкончание = Ложь;
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.Должность) Тогда
			СтрокаНабора.Должность = мРаботникиОрганизацийОкончание.Должность;
			ПроверкаНаОкончание = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.ПодразделениеОрганизации) И ПроверкаНаОкончание Тогда
			СтрокаНабора.ПодразделениеОрганизации = мРаботникиОрганизацийОкончание.ПодразделениеОрганизации;
		КонецЕсли;
		//Аверсон 27.04.2022 КВВ СВФР-008970 )
		
		//Аверсон ЕАЕ 07.12.2021 СВФР-008461
		//Если не ЗначениеЗаполнено(мРаботникиОрганизаций.Категория)  ТОгда
		//	СтрокаНабора.Категория = мРаботникиОрганизаций.Должность.Категория;
		//КонецЕсли;
		//Аверсон СВФР-008461
		
		//Аверсон ЕАЕ 07.12.2021 СВФР-008461
		Если СтрокаНабора.Организация.ПрочаяКатегорияДляНачисленияУволенным Тогда
			Уволен = СотрудникУволен(СтрокаНабора.Сотрудник, СтрокаНабора.ПериодРегистрации);
			КатегорияПрочее = Справочники.КатегорииРаботников.НайтиПоНаименованию("Прочее", Истина);
		Иначе
			Уволен = Ложь;
			КатегорияПрочее = Справочники.КатегорииРаботников.НайтиПоНаименованию("Прочее", Истина);
		КонецЕсли;
		Если Уволен И СтрокаНабора.Организация.ПрочаяКатегорияДляНачисленияУволенным И Не КатегорияПрочее.Пустая() Тогда
			СтрокаНабора.Категория = КатегорияПрочее;
		Иначе
			СтрокаНабора.Категория = мРаботникиОрганизаций.Категория;
			
			//Аверсон 27.04.2022 КВВ СВФР-008970 (
			//Если не ЗначениеЗаполнено(мРаботникиОрганизаций.Категория)  ТОгда
			//	СтрокаНабора.Категория = мРаботникиОрганизаций.Должность.Категория;
			//КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаНабора.Категория) И ПроверкаНаОкончание Тогда
				СтрокаНабора.Категория = мРаботникиОрганизацийОкончание.Категория;  
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаНабора.Категория) Тогда
				СтрокаНабора.Категория = СтрокаНабора.Должность.Категория;
			КонецЕсли;
			//Аверсон 27.04.2022 КВВ СВФР-008970 )
		КонецЕсли;
		//Аверсон СВФР-008461
		
		//Аверсон 23.05.2022 КВВ СВФР-009094 (
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.ауМестоРаботы) 
			И (ЗначениеЗаполнено(мРаботникиОрганизаций.ауМестоРаботы) ИЛИ ЗначениеЗаполнено(мРаботникиОрганизацийОкончание.ауМестоРаботы)) Тогда
			СтрокаНабора.ауМестоРаботы = ?(ЗначениеЗаполнено(мРаботникиОрганизаций.ауМестоРаботы),мРаботникиОрганизаций.ауМестоРаботы, мРаботникиОрганизацийОкончание.ауМестоРаботы);
		КонецЕсли;
		//Аверсон 23.05.2022 КВВ СВФР-009094 )
		//СВФР-017061 16.10.2025
		Если не ЗначениеЗаполнено(СтрокаНабора.ПодразделениеОрганизации) тогда
			СтрокаНабора.ПодразделениеОрганизации = мРаботникиОрганизацийОкончание.ПодразделениеОрганизации;
		КонецЕсли;
		//СВФР-017061 16.10.2025
	КонецЦикла;
КонецПроцедуры

//Аверсон ЕАЕ 07.12.2021 СВФР-008461
Функция СотрудникУволен(Сотр, НаДату)
	Уволен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаботникиОрганизацийСрезПоследних.Сотрудник
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НаДату, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Уволен = Истина;
	КонецЕсли;
	
	Возврат Уволен;
КонецФункции
//Аверсон СВФР-008461
